from random import choice
def random_pick(variants):
    return choice(variants)
def verify_continue():
    while True:
        answer = input('Хочешь задать еще вопрос? (да/нет): ').strip().lower()
        if answer == 'да':
            return True
        if answer == 'нет':
            return False
        print('Некорректный ввод, попробуй еще раз!')
def main():
    answers = ['Бесспорно', "Предрешено", "Никаких сомнений", "Определенно да", "Можешь быть уверен в этом", "Мне кажется - да", "Вероятнее всего", "Хорошие перспективы", "Знаки говорят - да", "Да", "Пока неясно, попробуй снова", "Спроси позже", "Лучше не рассказывать", "Сейчас нельзя предсказать", "Сконцентрируйся и спроси опять", "Даже не думай", "Мой ответ - нет", "По моим данным - нет", "Перспективы не очень хорошие", "Весьма сомнительно" ]
    print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос')
    n = input('Как тебя зовут? ').strip()
    if not n:
        print('Привет, незнакомец!')
    else:
        print(f'Привет, {n}!')
    while True:
        q = input('Задай свой вопрос! ').strip()
        if not q:
            print('Шар не может ответить на тишину, попробуй еще раз!')
            continue
        print(random_pick(answers))
        if not verify_continue():
            print('Возвращайся, если возникнут вопросы!')
            break
if __name__ == '__main__':
    main()